package java1.c조건문반복문;

import java.util.Scanner;

public class EX4_자판기 {//class s

	public static void main(String[] args) {//main s
		
		// 0. 입력객체
		Scanner scanner = new Scanner(System.in);
		
		// 1. 공통 변수( 제품 3개 -> 3개 , 장바구니 제품 3개 -> 3개 )					변수( ?? ) 초기재고/장바구니/돈/
		int 콜라재고 = 10;	int 환타재고 = 10;	int 사이다재고 = 10;				// 1. 각 변수에 10 대입 [ 재고 ]
		int 콜라구매수 = 0;		int 환타구매수 = 0;		int 사이다구매수 = 0;	// 2. 		 
		
		
		while(true) {//2. 무한루프 [ 무한반복 ] - 종료조건 없음
			System.out.println("--------------------[자판기]-------------------");
			System.out.println("메뉴 : 1. 콜라(300) 2. 환타(400) 3. 사이다(500) 4. 결제");
			System.out.print(" 선택 : "); int 메뉴선택 = scanner.nextInt();						//입력하면 이제 무한으로 입력가능 / int니까 문자는 입력하면 멈춤
			if( 메뉴선택 == 1 ) {  // 1번을 입력했을 때							
				// 재고 있다/없다 [ 경우의 수 2개 ]
				if( 콜라재고 > 0 ) {//재고있다.
					콜라재고--; 콜라구매수++;
					System.out.println("콜라를 장바구니에 담았습니다.");
				}else {//재고없다.
					System.out.println("안내) 콜라재고가 없습니다. [죄송합니다ㅠ0ㅠ]");
				}
			}	//else if1 e		
			else if( 메뉴선택 == 2 ) {  // 2번을 입력했을 때
				if( 환타재고 > 0 ) {//재고있다.
					환타재고--; 환타구매수++;
					System.out.println("환타를 장바구니에 담았습니다.");
				}else {//재고없다.
					System.out.println("안내) 환타재고가 없습니다. [죄송합니다ㅠ_ㅠ]");
				}
						
			}		
			else if( 메뉴선택 == 3 ) {  // 3번을 입력했을 때
				if( 사이다재고 > 0 ) {//재고있다.
					사이다재고--; 사이다구매수++;
					System.out.println("사이다를 장바구니에 담았습니다.");
				}else {//재고없다.
					System.out.println("안내) 사이다재고가 없습니다. [죄송합니다ㅠㅅㅠ]");
				}				
			}		
			else if( 메뉴선택 == 4 ) {  // 4번을 입력했을 때
				System.out.println("-------------------[장바구니]-------------------");
				System.out.println("제품명\t구매수\t가격");
				if( 콜라구매수>0 ) { System.out.println("콜라\t+콜라구매수+\t+(콜라구매수*300) "); }
				if( 환타구매수>0 ) { System.out.println("환타\t+환타구매수+\t+(환타구매수*400) "); }
				if( 사이다구매수>0 ) { System.out.println("사이다\t+사이다구매수+\t+(사이다구매수*500) "); }
				int 총결제금액 = (콜라구매수*300)+(환타구매수*400)+(사이다구매수*500);
				System.out.println("안내) 총 결제예정금액 : "+총결제금액+"원");
				System.out.println("안내) 총 결제예정금액 : " + (콜라구매수*300)+(환타구매수*400)+(사이다구매수*500));
				
				System.out.print("안내) 결제 하시겠습니까? [Y] [N] "); String 결제여부 = scanner.next();
				
				if( 결제여부.equals("Y") || 결제여부.equals("y") ) {
					
					System.out.print("안내) 결제금액을 투여해주세요 : "); int 투입금액 = scanner.nextInt(); 
					if( 총결제금액 > 투입금액 ) { System.out.println("안내) 금액이 부족합니다. [결제취소]"); }
					else {System.out.println("안내) 구매 완료 번호:0000 [잔돈 : "+(투입금액-총결제금액)+"원]");}
				
				// 결제취소 : 금액이 부족하거나, 결제여부가 N이면 => 재고를 구매수만큼 다시 채우기
				// 결제성공 : 장바구니 0으로 초기화
				}
				
				boolean 결제성공 = false;	//결제 성공 여부를 저장하는 변수 [ 스위치 변수 ]
				
				if( 결제성공 == false ){
					콜라구매수 = 0; 환타구매수 = 0; 사이다구매수 =0;
				}else {//결제취소 : 금액이 부족하거나, 결제여부가 N이면 => 재고를 구매수만큼 다시 채우기
					콜라재고 += 콜라구매수; 환타재고 += 환타구매수; 사이다재고 += 사이다구매수;
					콜라구매수 = 0; 환타구매수 = 0; 사이다구매수 =0;
				}
				
				System.out.println("---------------------------------------------");
			}
			else { System.out.println("안내) 선택할 수 없는 번호입니다. 다시 선택해주세요."); }					// 그 외를 입력했을 때	/	err로 하면 빨간 글씨로 됨 그냥 에러니까..
		
		
		
		
		}	
		
	}//main e
	
}// class e

/*

	자판기 프로그램
		1. 제품명 : 콜라 , 환타 , 사이다
		2. 초기재고 : 각 10개
		3. 메뉴판에서 선택한 제품을 장바구니에 담기
			1. 선택 제품의 재고가 0이면 '재고 없음' 출력 -> 나감
			2. 해당 제품의 수를 1 차감 -> 장바구니 제품의 수량을 1 증가
			3. 장바구니애 담았습니다. 출력
		
		4. 결제를 선택했을 때 장바구니 현황 표시 결제여부 물어보고, 돈을 입력받고[scanner를 사용]
		5. 금액이 부족하면 결제취소, 금액이 결제예정인것보다 초과이면 거스름돈 출력
		
		[ 화면구현 ]
		1. 메뉴판 : 1. 콜라 2. 환타 3. 사이다 4. 결제
		2. 
*/