/*
 	기본 자료형 : 숫자형, 문자열, 불(논리)
 		저장소 [=메모리]
 자료형이 저장소의 사이즈를 정함..
 
 	변수/상수 : 데이터 1개 저장할 수 있는 공간		메모리(컴퓨터 = 숫자) 사람은 문자가 편하고 컴퓨터는 숫자가 편하지~ 단독주택같은 변수
 		1. 변수 : 변하는 수[let]						주소번지	식별 : 메모리주소(번지) 16진수
 			
 							변수이름(문자)	->	메모리주소(16진수)
 			
 			변수이름 : 번지주소를 외울 수 없으니까 도로명처럼 만들어줌 - >그렇기때문에 중복안됨
 		2. 상수 : 고정된 수[const]
 		
 		배열 : 데이터 여러개를 저장할 수 있는 공간(한개도 저장 가능) 아파트.. 같은 배열 = [ 값1, 값2, 값3 ]
				배열이름(문자) --> 메모리주소(16진수)		
 										메모리->메모리2->메모리3->메모리4->  아파트처럼 주소를 연결연결
 										
 										
 		연산자 : 1. 산술연산자 2.2 비교연산자 3. 논리연산자 4. 대입연산자 5. 증감연산자 6. 삼향연산자	
 		
 		제어 : if 
 		
 		반복 : for					
 										
 										
 	저장공간 [ = 메모리 = 주기억장치 - RAM] 
 		
 		*명령어 [0,1] -> 명령어 -> 프로세스 -> 프로그램
 							_________________________본체_______________________
 	키보드나 마우스를 써서 입력 ->  1. CPU : 논리, 명령어 제어, 번역, 계산하는데 저장을 못함,,
 							레지스터 : 명령어들 임시 저장소 (용량이 엄청 작음?) CPU가 번역하는도안 깜박하면 안되니까 여기에 저장
 						    
 						    2. 메모리 주기억장치 : RAM : 현재 실행중인 프로그램 [명령어] 현재 실행중인것만 기억함 -> 영구저장 안됨
 	
    모니터         		<-	3. ssd 놈? 보조기억장치 : 사용자가 삭제하지 않는 이상 영구저장 , 코드 자체는 주기억장치
 								USB , C , CD , DVD , Database
 	
 */